EA/src/Catalogs/НастройкиУсловнойРегистрацииВУзлахПлановОбмена.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Catalog>
		<Properties>
			<Name>НастройкиУсловнойРегистрацииВУзлахПлановОбмена</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НастройкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыОбъектов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидОбъекта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыОбъектовМ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Регистрировать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВсеБезУсловий</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>УзлыПлановОбмена</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Узел</Name>
							<Type>
								<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

EA/src/Catalogs/НастройкиУсловнойРегистрацииВУзлахПлановОбмена/ObjectModule.bsl
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	// проверим дублирование в тч ВидыОбъектов
	КопТабЧастиВидыОбъектов = ЭтотОбъект.ВидыОбъектов.Выгрузить( , "ВидОбъекта" );
	КопТабЧастиВидыОбъектов.Свернуть( "ВидОбъекта", "" );
	
	Если КопТабЧастиВидыОбъектов.Количество() <> ЭтотОбъект.ВидыОбъектов.Количество() Тогда
		ОбменДаннымиСервер.СообщитьОбОшибке( "В таб. части ""Виды Объектов"" есть повторяющиеся значения Вида Объекта. Дублирования Вида Объекта недопустимо.", Отказ );
	КонецЕсли;
	
	// проверим на наличие Узлов, относящихся к текущей базе
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр( "ТаблицаУзлов", ЭтотОбъект.УзлыПлановОбмена.Выгрузить( , "НомерСтроки, Узел" ) );
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаУзлов.НомерСтроки КАК НомерСтроки,
	|	ТаблицаУзлов.Узел КАК Узел
	|ПОМЕСТИТЬ табУзлов
	|ИЗ
	|	&ТаблицаУзлов КАК ТаблицаУзлов
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	табУзлов.НомерСтроки КАК НомерСтроки
	|ИЗ
	|	табУзлов КАК табУзлов
	|ГДЕ
	|	табУзлов.Узел.ЭтотУзел = ИСТИНА
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДаннымиСервер.СообщитьОбОшибке( "В строке " + Выборка.НомерСтроки + " таб. части ""Узлы планов обмена"" указан узел, относящийся к текущей базе.", Отказ );
	КонецЦикла;
	
	
КонецПроцедуры
